# PANDAS 
es una biblioteca popular para en analisis de datos en python, provee una poderosa y flexible grupo de herramientoas para trabajar con data estructurada

In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\user\anaconda3\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in c:\users\user\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\user\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\user\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [11]:
# instalamos pandas y lo importamos para poder usar sus funciones
import pandas as pd

In [13]:
# crearemos un dataframe a partir de un diccionario 

#creemos el diccionario x 
x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#convirtamos el diccionario en un dataframe
df = pd.DataFrame(x)

#y mostremos el resultado del dataframe (df)
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [17]:
# podemos seleccionar una columna llamandola por su nombre en este caso
# seleccionaremos ID 

x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

In [21]:
# compruebe el tipo de x para ver como se ha convertiroo en un dataframe de pandas
type(x)

pandas.core.frame.DataFrame

In [23]:
# tambien puede acceder a varias columnas si asi lo requiere
z = df[['Department', 'Salary', 'ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [25]:
# Puede convertir una columna a una series con solo un []

s = df['Salary'] 
s

0    100000
1     80000
2     50000
3     60000
Name: Salary, dtype: int64

In [27]:
# compruebe 

type(s)

pandas.core.series.Series

In [29]:
# funciones loc() y iloc()
# loc() es un metodo de soleccion basado en etiquetas, lo que significa que debemos
# pasar el nombre de la fila o columna que queremos seleccionar 
# loc[etiqueta_fila,etiqueta_columna]

df.loc[0, 'Salary']

100000

In [31]:
# iloc() es un metodo de seleccion basado en indices, lo que significa que debemos
# pasar un indice entero en el metodo para seleccionar una fila/columna espeficia
# iloc[indice_fila,indice_columna]

df.iloc[0, 0]

'Rose'

In [33]:
df.iloc[0,2]

'Architect Group'

In [37]:
# Creemos un nuevo marco de datos llamado 'df2' y asignémosle 'df'. Ahora, vamos a establecer la columna «Nombre» como una columna de índice utilizando el método set_index

df2=df
df2=df2.set_index('Name')
df2

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [41]:
# muestre las primeras 5 filas del nuevo dataframe

df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [43]:
# ahora, acceda a la columna usando el nombre 

df2.loc['Jane','Salary']

50000

In [47]:
# ejercio, encuentre el departamento de Jane

df2.loc['Jane','Department']

'Design Team'

In [49]:
# use el metodo iloc(), para encontrar el salary de Mary 
df2.iloc[3,2]

60000

In [61]:
# Slicing se utiliza [] para seleccionar un conjunto de filas o columnas, 
# para tropezar un conjunto de filas usamos data[start:stop]
# ejemplo si quieres seleccionar las filas 0,1,2 el codigo seria df.iloc[0:3]
# NOTA en la funcion loc() los limites son inclusivos por lo que si quiere obtener 0,1,2 seria df.loc[0:2]

df.iloc[0:3,1:3]

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [57]:
# mire la diferencia 
df.loc[0:2,'ID':'Department']

   ID       Department
0   1  Architect Group
1   2   Software Group
2   3      Design Team

In [63]:
df2.loc['Rose':'Jane', 'ID':'Department']

      ID       Department
Name
Rose   1  Architect Group
John   2   Software Group
Jane   3      Design Team

In [67]:
# ejercicio, usando loc() haga un slicing del df para recuperar nombre, id y departamento y etiquetas 2,3
df.loc[2:3,'ID':'Department']

   ID      Department
2   3     Design Team
3   4  Infrastructure

## Cargar Datos con panda